recipes/green-power-tofu-sandwich.org
#+TITLE: Green power tofu sandwich
#+DATE: 2025-02-09
#+SETUPFILE: recipe.setup

[[https://www.pickuplimes.com/recipe/green-power-tofu-subs-1743?mcp_token=eyJwaWQiOjEyMDQ5ODksInNpZCI6NjU1MzU1MTM5LCJheCI6ImFkMTUyYWU3YzFkYWNkMzdlYTYyY2FhZDNiZTA1NDRjIiwidHMiOjE3MzkwNjA1MzksImV4cCI6MTc0MTQ3OTczOX0.eNb9TJqXHNF3E3tA91oREul-qcCskxVAGd8qhga1jvA][Original link]]

* Ingredients
** Pickled Cucumber
- 1/2 cucumber, thinly sliced
- 1/4 cup (60 mL) rice vinegar
- 2 Tbsp (30 mL) sweet chili sauce
** Edamame pea spread
- 1/2 cup (72 g) fresh green peas
- 1/2 cup (78 g) cooked shelled edamame
- 2 Tbsp (30 mL) peanut butter
- 1 garlic clove
- 1 lime, juiced
- 1/8 tsp salt
** Spicy mayo
- 1/4 cup (60 mL) vegan mayonnaise
- 1/2 Tbsp (7 mL) sriracha hot sauce
** Shredded tofu
- 18 oz (500 g) firm tofu, pressed
- 1 Tbsp (15 mL) vegetable oil
- 1/4 cup (60 mL) sodium-reduced soy sauce
- 1 Tbsp (14 g) brown sugar
- 1/2 Tbsp (4 g) toasted sesame seeds
** Assembly
- 4 small baguettes, toasted
- 1/2 cup (8 g) fresh cilantro
** Optional toppings
- sliced green onion
- chopped roasted peanuts

* Instructions
1. Add the cucumber slices to a bowl and cover with the vinegar and chili sauce. Mix and set aside.
1. Add all the ingredients for the edamame pea spread to a small food processor.
1. Blend until combined. Set it aside.
1. In a small bowl, mix together the mayo and sriracha. Set aside.
1. Use a box grater to grate the tofu into shreds.
1. Add the oil and shredded tofu to a sauté pan and cook for 4 - 5 minutes, until lightly golden.
1. Then, add the remaining ingredients for the shredded tofu and cook for an additional 2 minutes.
1. Slice the bread open and lather the edamame pea spread on one half and the sriracha mayo on the other half of the sub.
1. Then add the shredded tofu, pickled cucumbers, cilantro, green onion, and peanuts. Enjoy!
