recipes/green-power-tofu-sandwich.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Green power tofu sandwich</title>
<meta name="author" content="james" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content" class="content">
<h1 class="title">Green power tofu sandwich</h1>
<p>
<a href="https://www.pickuplimes.com/recipe/green-power-tofu-subs-1743?mcp_token=eyJwaWQiOjEyMDQ5ODksInNpZCI6NjU1MzU1MTM5LCJheCI6ImFkMTUyYWU3YzFkYWNkMzdlYTYyY2FhZDNiZTA1NDRjIiwidHMiOjE3MzkwNjA1MzksImV4cCI6MTc0MTQ3OTczOX0.eNb9TJqXHNF3E3tA91oREul-qcCskxVAGd8qhga1jvA">Original link</a>
</p>

<div id="outline-container-org2ffbbbf" class="outline-2">
<h2 id="org2ffbbbf">Ingredients</h2>
<div class="outline-text-2" id="text-org2ffbbbf">
</div>
<div id="outline-container-org2d2c6b7" class="outline-3">
<h3 id="org2d2c6b7">Pickled Cucumber</h3>
<div class="outline-text-3" id="text-org2d2c6b7">
<ul class="org-ul">
<li>1/2 cucumber, thinly sliced</li>
<li>1/4 cup (60 mL) rice vinegar</li>
<li>2 Tbsp (30 mL) sweet chili sauce</li>
</ul>
</div>
</div>
<div id="outline-container-orge02b836" class="outline-3">
<h3 id="orge02b836">Edamame pea spread</h3>
<div class="outline-text-3" id="text-orge02b836">
<ul class="org-ul">
<li>1/2 cup (72 g) fresh green peas</li>
<li>1/2 cup (78 g) cooked shelled edamame</li>
<li>2 Tbsp (30 mL) peanut butter</li>
<li>1 garlic clove</li>
<li>1 lime, juiced</li>
<li>1/8 tsp salt</li>
</ul>
</div>
</div>
<div id="outline-container-orgd9e3c70" class="outline-3">
<h3 id="orgd9e3c70">Spicy mayo</h3>
<div class="outline-text-3" id="text-orgd9e3c70">
<ul class="org-ul">
<li>1/4 cup (60 mL) vegan mayonnaise</li>
<li>1/2 Tbsp (7 mL) sriracha hot sauce</li>
</ul>
</div>
</div>
<div id="outline-container-org97ce070" class="outline-3">
<h3 id="org97ce070">Shredded tofu</h3>
<div class="outline-text-3" id="text-org97ce070">
<ul class="org-ul">
<li>18 oz (500 g) firm tofu, pressed</li>
<li>1 Tbsp (15 mL) vegetable oil</li>
<li>1/4 cup (60 mL) sodium-reduced soy sauce</li>
<li>1 Tbsp (14 g) brown sugar</li>
<li>1/2 Tbsp (4 g) toasted sesame seeds</li>
</ul>
</div>
</div>
<div id="outline-container-org85cfe6c" class="outline-3">
<h3 id="org85cfe6c">Assembly</h3>
<div class="outline-text-3" id="text-org85cfe6c">
<ul class="org-ul">
<li>4 small baguettes, toasted</li>
<li>1/2 cup (8 g) fresh cilantro</li>
</ul>
</div>
</div>
<div id="outline-container-org45ab548" class="outline-3">
<h3 id="org45ab548">Optional toppings</h3>
<div class="outline-text-3" id="text-org45ab548">
<ul class="org-ul">
<li>sliced green onion</li>
<li>chopped roasted peanuts</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7c20236" class="outline-2">
<h2 id="org7c20236">Instructions</h2>
<div class="outline-text-2" id="text-org7c20236">
<ol class="org-ol">
<li>Add the cucumber slices to a bowl and cover with the vinegar and chili sauce. Mix and set aside.</li>
<li>Add all the ingredients for the edamame pea spread to a small food processor.</li>
<li>Blend until combined. Set it aside.</li>
<li>In a small bowl, mix together the mayo and sriracha. Set aside.</li>
<li>Use a box grater to grate the tofu into shreds.</li>
<li>Add the oil and shredded tofu to a sauté pan and cook for 4 - 5 minutes, until lightly golden.</li>
<li>Then, add the remaining ingredients for the shredded tofu and cook for an additional 2 minutes.</li>
<li>Slice the bread open and lather the edamame pea spread on one half and the sriracha mayo on the other half of the sub.</li>
<li>Then add the shredded tofu, pickled cucumbers, cilantro, green onion, and peanuts. Enjoy!</li>
</ol>
</div>
</div>
</div>
</body>
</html>
